In [1]:
%load_ext sql

In [3]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [5]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, 1542761878796, '80', 'paid', None, None, '774', 'Portland-South Portland, ME', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (2, 1542761921796, '97', 'paid', None, None, '671', 'Lansing-East Lansing, MI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/37.0.2062.94 Safari/537.36"'),
 (3, 1542762125796, '97', 'paid', None, None, '671', 'Lansing-East Lansing, MI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/37.0.2062.94 Safari/537.36"'),
 (4, 1542762193796, '80', 'paid', None, None, '774', 'Portland-South Portland, ME', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (5, 1542762329796, '97', 'paid', None, None, '671', 'Lansing-East Lansing, MI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/37.0.2062.94 Safari/537.36"')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('80', 'Tegan', 'Levine', 'F', 'paid'),
 ('97', 'Kate', 'Harrell', 'F', 'paid'),
 ('40', 'Tucker', 'Garrison', 'M', 'free'),
 ('65', 'Amiya', 'Davidson', 'F', 'paid'),
 ('26', 'Ryan', 'Smith', 'M', 'free')]

In [18]:
%sql SELECT * FROM songs where title = 'Atrevido' LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
0 rows affected.

[]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARULZCI1241B9C8611', 'Luna Orbit Project', '', Decimal('NaN'), Decimal('NaN')),
 ('ARLTWXK1187FB5A3F8', 'King Curtis', 'Fort Worth, TX', Decimal('32.74863'), Decimal('-97.32925')),
 ('AREVWGE1187B9B890A', 'Bitter End', 'Noci (BA)', Decimal('-13.442'), Decimal('-41.9952')),
 ('AR051KA1187B98B2FF', 'Wilks', '', Decimal('NaN'), Decimal('NaN')),
 ('ARVBRGZ1187FB4675A', 'Gwen Stefani', '', Decimal('NaN'), Decimal('NaN'))]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1542761878796, 0, 21, 47, 11, 2018, 2),
 (1542761921796, 0, 21, 47, 11, 2018, 2),
 (1542762125796, 1, 21, 47, 11, 2018, 2),
 (1542762193796, 1, 21, 47, 11, 2018, 2),
 (1542762329796, 1, 21, 47, 11, 2018, 2)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).

In [3]:
%sql SELECT s.title || a.name , count(1) FROM songplays sp join artists a using (artist_id)  join songs s using (song_id) group by 1 order by 2 desc limit 10;

 * postgresql://student:***@127.0.0.1/sparkifydb
1 rows affected.

[('Setanta matinsElena', 1)]

In [7]:
%sql SELECT duration,count(1) FROM songplays group by 1 order by 2 desc limit 10;

 * postgresql://student:***@127.0.0.1/sparkifydb
(psycopg2.ProgrammingError) column "duration" does not exist
LINE 1: SELECT duration,count(1) FROM songplays group by 1 order by ...
               ^
HINT:  Perhaps you meant to reference the column "songplays.location".
 [SQL: 'SELECT duration,count(1) FROM songplays group by 1 order by 2 desc limit 10;']

In [6]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOSWKAV12AB018FC91', 'Midnight Star', 'ARULZCI1241B9C8611', 0, Decimal('335.51628')),
 ('SODREIN12A58A7F2E5', 'A Whiter Shade Of Pale (Live @ Fillmore West)', 'ARLTWXK1187FB5A3F8', 0, Decimal('326.00771')),
 ('SOFCHDR12AB01866EF', 'Living Hell', 'AREVWGE1187B9B890A', 0, Decimal('282.43546')),
 ('SOLYIBD12A8C135045', 'Music is what we love', 'AR051KA1187B98B2FF', 0, Decimal('261.51138')),
 ('SORRZGD12A6310DBC3', 'Harajuku Girls', 'ARVBRGZ1187FB4675A', 2004, Decimal('290.55955'))]

In [4]:
%sql SELECT u.first_name||' '||u.last_name user_name,count(1) FROM users u join songplays using (user_id) group by 1 order by 2 desc LIMIT 10;

 * postgresql://student:***@127.0.0.1/sparkifydb
10 rows affected.

[('Kate Harrell', 130),
 ('Lily Koch', 103),
 ('Chloe Cuevas', 54),
 ('Mohammad Rodriguez', 43),
 ('Tegan Levine', 29),
 ('Amiya Davidson', 17),
 ('Matthew Jones', 13),
 ('Layla Griffin', 8),
 ('Zachary Thomas', 7),
 ('Ryan Smith', 7)]

In [ ]:
%sql SELECT u.first_name||' '||u.last_name user_name,count(1) FROM users u join songplays using (user_id) group by 1 order by 2 desc LIMIT 10;